module.exports = {
  '1000': '解析失败，可能文章内容不完整',
  '1001': '字段缺失',
  '1002': '请求文章内容失败',
  '1003': '请求文章内容为空',
  '1004': '访问过于频繁(url模式)', // 可以换 ip 重新请求，注意与 2010 的区别
  '1005': 'js 变量解析出错',

  '2001': '参数缺失',
  '2002': '链接已过期',
  '2003': '该内容被投诉且经审核涉嫌侵权，无法查看',
  '2004': '公众号迁移但文章未同步',
  '2005': '该内容已被发布者删除',
  '2006': '此内容因违规无法查看',
  '2007': '涉嫌违反相关法律法规和政策发送失败',
  '2008': '微信文章系统出错',
  '2009': '链接不正确',
  '2010': '访问过于频繁(HTML模式)', // 解析参数为直接的文章内容，此时该篇内容已经无效，可以丢弃
  '2011': '由用户投诉并经平台审核，涉嫌过度营销、骚扰用户',
  '2012': '帐号已被屏蔽, 内容无法查看',
  '2013': '此帐号已自主注销',
  '2014': '不实信息',
  '2015': '此帐号处于帐号迁移流程中'
}
